{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "war",
    "1": "sanctions",
    "2": "pandemic",
    "3": "natural_disaster",
    "4": "supply_shock",
    "5": "political_crisis",
    "6": "economic_crisis",
    "7": "cyberattack",
    "8": "energy_crisis",
    "9": "trade_agreement"
  },
  "initializer_range": 0.02,
  "label2id": {
    "cyberattack": 7,
    "economic_crisis": 6,
    "energy_crisis": 8,
    "natural_disaster": 3,
    "pandemic": 2,
    "political_crisis": 5,
    "sanctions": 1,
    "supply_shock": 4,
    "trade_agreement": 9,
    "war": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "use_cache": false,
  "vocab_size": 30522
}
